/**
 * @File jp
 * @Author nagatoyuki
 * @Date 2021/7/6 - 10:19 上午
 */
export default {
	header: [
		'交換する',
		'マイニングプール',
		'取締役会',
		'リンクウォレット\n',
		'ファーム'
	],
	user: {
		connect: [
			'あなたの財布をリンク！',
			'MetaMask',
			'新しい',
			'ZBC',
			'ガイドを参照してください'
		],
		account: [
			'アカウント',
			'メタマスクへのリンク',
			'コピーアドレス',
			'ビュー',
			'招待する',
			'取引はここに表示されます…'
		],
		invite: [
			'招待する',
			'友達を招待して報酬をもらう',
			'部下のウォレットアドレスを入力してください',
			'練る'
		]
	},
	settings: [
		'トランザクション設定',
		'スリッページ差',
		'取引期限',
		'分',
		'言語'
	],
	swap: {
		form: [
			'から',
			'資金: ',
			'最大',
			'に'
		],
		select: [
			'選択',
			'トークンを選択してください',
			'名前を検索するか、アドレスを貼り付けます'
		],
		btn: [
			'間違ったネットワーク',
			'この取引における不十分な流動性',
			'金額を入力してください',
			'取引の確認',
			'認定',
			'とにかくスワップ',
			'価格への影響が高すぎる'
		],
		info: [
			'スリッページ差',
			'現在のスリッページ許容値',
			'価格への影響',
			'取引規模による市場価格とあなたの価格の差。',
			'受け取った最小値',
			'それが確認される前に大きな不利な価格変動がある場合、あなたの取引は元に戻ります',
			'手数料'
		],
		confirm: [
			'取引の確認',
			'出力は推定されます。 少なくとも',
			'を受け取るか、トランザクションが元に戻ります。',
			'価格',
			'受け取った最小値:',
			'取引手数料:'
		]
	},
	pool: {
		title: 'すべてのトランザクションでZBCを無料で入手できます！',
		subTitle: 'DEXを統合する最大のDeFiエコシステムを作成する',
		tab: [
			'あなたの流動性',
			'流動性を追加する'
		],
		content: {
			add: {
				form: [
					'入る',
					'プールのシェア'
				],
				btn: [
					'流動性',
					'追加',
					'作成する'
				],
				position: [
					'あなたの位置',
					'あなたのプールシェア',
				],
				confirm: {
					s1: [
						'あなたが受け取る',
						'Pool Tokens',
						'出力は推定されます。 価格が ',
						' を超えて変化した場合、トランザクションは元に戻ります。',
						'寄託',
						'料金',
						'プールのシェア:',
						'確認の支払い'
					],
					s2: [
						'確認を待ちます...',
						'ウォレットでこのトランザクションを確認します'
					],
					s3: [
						'トランザクションが送信されました',
						'閉じる'
					],
					s4: [
						'処理に失敗しました',
						'閉じる'
					]
				}
			},
			your: {
				noData: [
					'ウォレットに接続します',
					'スイッチネットワーク',
					'あなたの流動性を見るために。',
					'流動性は見つかりませんでした。'
				],
				colContent: {
					form: [
						'あなたのプールトークン:',
						'フローセル',
						'あなたのプールシェア:'
					],
					btn: [
						'削除する',
						'追加'
					]
				}
			},
			remove: {
				title: '流動性を取り除く',
				form: [
					'量',
					'価格'
				],
				btn: [
					'認定',
					'削除する'
				],
				position: [
					'あなたの位置',
					'あなたのプールシェア'
				],
				confirm: [
					'出力は推定されます。 少なくとも',
					'と',
					'を受け取るか、トランザクションが元に戻ります。',
					'価格',
					'確認'
				]
			}
		}
	},
	mining: {
		message: [
			'採掘後、24時間以上必要な時間を抽出します',
			'採掘の過程で、収入が発生した後にのみ抽出することができます',
			'鉱山プールは招待された住所にのみ開かれています。 上司に拘束されて鉱業に参加していることを確認してください。そうしないと、鉱業収入を得ることができません。'
		],
		currency: [
			'収穫',
			'APY',
			'寄託',
			'利回り',
			'ロック',
			'残り',
			'始まる時間',
			'APR',
			'APY',
			'毎日の収入の引き出しと手動の再投資。複利の収益は時間の経過とともにますます高くなります。'
		],
		btn: [
			'承認',
			'保証金',
			'取り除く',
			'収入を分配する'
		],
		withdraw: {
			normal: [
				'取り除く',
				'寄託',
				'利回り',
				'確認'
			],
			s2: [
				'確認を待ちます...',
				'ウォレットでこのトランザクションを確認します'
			],
			s3: [
				'トランザクションが送信されました',
				'閉じる'
			],
			s4: [
				'処理に失敗しました',
				'閉じる'
			]
		},
		deposit: {
			normal: [
				'保証金',
				'収穫',
				'資金',
				'金額を入力してください',
				'最大',
				'確認'
			]
		}
	},
	toast: [
		'コピー成功！',
		'コピーエラー！',
		'承認に失敗しました',
		'数量を選択してください',
		'トークンを選択してください',
		'残高不足です'
	],
	confirmMessage: [
		'交換する',
		'にとって'
	],
	alert: {
		point: [
			'お知らせ',
			'確認'
		],
		warning: [
			'警告',
			'最初に承認してください'
		]
	}
}