/**
 * @File kn
 * @Author nagatoyuki
 * @Date 2021/7/6 - 3:19 下午
 */
export default {
	header: [
		'교환',
		'광업 풀',
		'이사회',
		'링크 지갑',
		'농장'
	],
	user: {
		connect: [
			'지갑 연결',
			'MetaMask',
			'새로운 ',
			'ZBC',
			'가이드를 참조하세요'
		],
		account: [
			'계정',
			'MetaMask에 연결',
			'주소 복사',
			'보기 ',
			'초대',
			'거래 내역이 여기에 표시됩니다…'
		],
		invite: [
			'초대',
			'친구를 초대하여 보상 받기',
			'부하 직원의 지갑 주소를 입력 해주세요.',
			'묶다'
		]
	},
	settings: [
		'거래 설정',
		'미끄러짐 허용 오차',
		'거래 기한',
		'의사록',
		'언어'
	],
	swap: {
		form: [
			'부터',
			'자금: ',
			'상한',
			'에게'
		],
		select: [
			'거래 쌍 선택',
			'토큰 선택',
			'이름 검색 또는 주소 붙여 넣기'
		],
		btn: [
			'잘못된 네트워크',
			'이 거래를위한 불충분 한 유동성',
			'금액 입력',
			'거래 확인',
			'권한 부여 ',
			'어쨌든 스왑',
			'가격 영향이 너무 높음'
		],
		info: [
			'미끄러짐 공차',
			'현재 미끄러짐 허용 오차',
			'가격 영향',
			'거래 규모로 인한 시장 가격과 귀하의 가격의 차이.',
			'최소 수령',
			'확인되기 전에 불리한 가격 변동이 크면 거래가 되돌아갑니다.',
			'수수료'
		],
		confirm: [
			'거래 확인',
			'출력이 추정됩니다. 최소',
			'를 받으시거나 거래가 취소됩니다.',
			'가격',
			'최소 수령:',
			'거래 수수료:'
		]
	},
	pool: {
		title: '모든 거래에서 ZBC를 무료로받을 수 있습니다!',
		subTitle: 'DEX를 통합하는 가장 큰 DeFi 에코 시스템 생성',
		tab: [
			'귀하의 유동성',
			'유동성 증대'
		],
		content: {
			add: {
				form: [
					'시작하다',
					'풀 점유율'
				],
				btn: [
					'유동성',
					'더하다',
					'창조하다'
				],
				position: [
					'너의 위치',
					'수영장 점유율',
				],
				confirm: {
					s1: [
						'당신은 받게 될 것입니다',
						'Pool Tokens',
						'출력이 추정됩니다. 가격이 ',
						' 이상 변경되면 거래가 취소됩니다.',
						'입금',
						'요금',
						'풀 점유율:',
						'공급 확인'
					],
					s2: [
						'확인을 기다리는 중 ...',
						'지갑에서이 거래를 확인하세요'
					],
					s3: [
						'거래가 제출되었습니다',
						'닫기'
					],
					s4: [
						'거래 실패',
						'닫기'
					]
				}
			},
			your: {
				noData: [
					'지갑에 연결',
					'네트워크 전환',
					'유동성을보기 위해.',
					'유동성이 없습니다.'
				],
				colContent: {
					form: [
						'풀 토큰 :',
						'정당들',
						'수영장 점유율:'
					],
					btn: [
						'없애다',
						'더하다'
					]
				}
			},
			remove: {
				title: '유동성 제거',
				form: [
					'양',
					'가격'
				],
				btn: [
					'승인',
					'없애다'
				],
				position: [
					'너의 위치',
					'수영장 점유율'
				],
				confirm: [
					'출력이 추정됩니다. 당신은 적어도',
					'과',
					'를받을 것입니다. 그렇지 않으면 거래는 되돌릴 것입니다.',
					'가격',
					'확인'
				]
			}
		}
	},
	mining: {
		message: [
			'채굴 후 24 시간 이상 소요되는 시간 추출',
			'채굴 과정에서 수입이 발생한 후에 만 추출 할 수 있습니다.',
			'광산 풀은 초대 된 주소로만 개방됩니다. 당신이 광업에 참여하기 위해 상급자에게 구속되었는지 확인하십시오. 그렇지 않으면 광업 수입을 얻을 수 없습니다.'
		],
		currency: [
			'추수',
			'APY',
			'입금',
			'관심',
			'잠금',
			'남은',
			'시작 시간',
			'APR',
			'APY',
			'일일 소득 인출 및 수동 재투자 복리 수익률은 시간이 지남에 따라 점점 더 높아질 것입니다.'
		],
		btn: [
			'Approving',
			'Deposit',
			'Withdrawal',
			'소득 분배'
		],
		withdraw: {
			normal: [
				'Withdraw',
				'Deposited',
				'관심',
				'확인'
			],
			s2: [
				'확인을 기다리는 중 ...',
				'지갑에서이 거래를 확인하세요'
			],
			s3: [
				'거래가 제출되었습니다',
				'닫기'
			],
			s4: [
				'거래 실패',
				'닫기'
			]
		},
		deposit: {
			normal: [
				'예금',
				'추수',
				'자금',
				'금액을 입력하세요',
				'상한',
				'확인'
			]
		}
	},
	toast: [
		'복사 성공!',
		'복사 오류!',
		'승인 실패',
		'수량을 선택하세요',
		'토큰을 선택하세요',
		'잔액 불충분'
	],
	confirmMessage: [
		'교환',
		'for'
	],
	alert: {
		point: [
			'신속한',
			'확인'
		],
		warning: [
			'경고',
			'먼저 승인하십시오'
		]
	}
}